trunk/app/controllers/banks_controller.rb

SELECT "banks".* FROM "banks"
---
  def index
    @banks = Bank.all

SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bank = Bank.find(params[:id])

INSERT INTO "banks" ("created_at", "nama_bank", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 28 Sep 2013 16:52:44 UTC +00:00], ["nama_bank", "Bank Mandiri"], ["updated_at", Sat, 28 Sep 2013 16:52:44 UTC +00:00]]
---
  def create
    @bank = Bank.new(params[:bank])

    respond_to do |format|
      if @bank.save