trunk/app/controllers/lokasi_atms_controller.rb

  def index
    @lokasi_atms = LokasiAtm.all
---
SELECT "lokasi_atms".* FROM "lokasi_atms"

  def show
    @lokasi_atm = LokasiAtm.find(params[:id])
---
SELECT "lokasi_atms".* FROM "lokasi_atms" WHERE "lokasi_atms"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @lokasi_atm = LokasiAtm.new(params[:lokasi_atm])

    respond_to do |format|
      if @lokasi_atm.save
---
INSERT INTO "lokasi_atms" ("bank_id", "created_at", "jumlah_tarik_id", "lat", "lng", "nama_atm", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)